Catalogs/КартСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КартСчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяВладельцемСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицоВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификационныйКодЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КартСчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	

	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура ЗаполнитьФизЛицоВладелецСчета(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МетаданныеСправочника = Метаданные.Справочники.КартСчета;
	Если МетаданныеСправочника.Реквизиты.Найти("УдалитьФамилия") = Неопределено
	 Или МетаданныеСправочника.Реквизиты.Найти("УдалитьИмя") = Неопределено
	 Или МетаданныеСправочника.Реквизиты.Найти("УдалитьОтчество") = Неопределено
	 Или МетаданныеСправочника.Реквизиты.Найти("УдалитьИдентификационныйКодЛичности") = Неопределено Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КартСчета.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(КартСчета.Ссылка) КАК Представление,
	|	КартСчета.УдалитьФамилия КАК УдалитьФамилия,
	|	КартСчета.УдалитьИмя КАК УдалитьИмя,
	|	КартСчета.УдалитьОтчество КАК УдалитьОтчество,
	|	КартСчета.УдалитьИдентификационныйКодЛичности КАК УдалитьИдентификационныйКодЛичности
	|ИЗ
	|	Справочник.КартСчета КАК КартСчета
	|ГДЕ
	|	КартСчета.НеЯвляетсяВладельцемСчета
	|	И КартСчета.ФизЛицоВладелецСчета = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	И (СОКРЛП(КартСчета.УдалитьФамилия) <> """"
	|			ИЛИ СОКРЛП(КартСчета.УдалитьИмя) <> """"
	|			ИЛИ СОКРЛП(КартСчета.УдалитьОтчество) <> """"
	|			ИЛИ СОКРЛП(КартСчета.УдалитьИдентификационныйКодЛичности) <> """")");
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПроизошлаОшибка = Ложь;
		СообщениеОбОшибке = "";
		
		Попытка
			НачатьТранзакцию();
			
			ДанныеФизЛица = Новый Структура;
			ДанныеФизЛица.Вставить("Фамилия"   , СокрЛП(Выборка.УдалитьФамилия));
			ДанныеФизЛица.Вставить("Имя"       , СокрЛП(Выборка.УдалитьИмя));
			ДанныеФизЛица.Вставить("Отчество"  , СокрЛП(Выборка.УдалитьОтчество));
			
			ФИО = Новый Массив;
			Если Не ПустаяСтрока(ДанныеФизЛица.Фамилия) Тогда
				ФИО.Добавить(ДанныеФизЛица.Фамилия);
			КонецЕсли;
			Если Не ПустаяСтрока(ДанныеФизЛица.Имя) Тогда
				ФИО.Добавить(ДанныеФизЛица.Имя);
			КонецЕсли;
			Если Не ПустаяСтрока(ДанныеФизЛица.Отчество) Тогда
				ФИО.Добавить(ДанныеФизЛица.Отчество);
			КонецЕсли;
			ФИО = СтрСоединить(ФИО, " ");
			
			ДанныеФизЛица.Вставить("ФИОФизЛица", ФИО);
			ДанныеФизЛица.Вставить("ИИН"       , Выборка.УдалитьИдентификационныйКодЛичности);
			
			ФизЛицоВладелецСчета = Справочники.ФизическиеЛица.СоздатьНайтиФизическоеЛицо(ДанныеФизЛица, Ложь);
			Если ФизЛицоВладелецСчета = Неопределено Тогда
				ПроизошлаОшибка = Истина;
				СообщениеОбОшибке = СтрШаблон(НСтр("ru='Для карт-счета %3 не удалось создать физ.лицо-владельца %1 (ИИН %2)'"), ФИО, ДанныеФизЛица.ИИН, Выборка.Представление);
			Иначе
				КартСчетОбъект = Выборка.Ссылка.ПолучитьОбъект();
				КартСчетОбъект.ФизЛицоВладелецСчета = ФизЛицоВладелецСчета;
				КартСчетОбъект.ОбменДанными.Загрузка = Истина;
				КартСчетОбъект.Записать();
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
		Исключение
			ПроизошлаОшибка = Истина;
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если ПроизошлаОшибка Тогда
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru='Операция не выполнена'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, МетаданныеСправочника, Выборка.Ссылка, СообщениеОбОшибке);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
